{
    "ieeesection": {
        "ieeeTopics": [
            {
                "id": "about",
                "icon": "fa-info-circle",
                "label": "What is IEEE ?",
                "desc": "Definition and global impact"
            },
            {
                "id": "history",
                "icon": "fa-history",
                "label": "History & Foundation",
                "desc": "Origin and milestones"
            },
            {
                "id": "ieeesites",
                "icon": "fa-globe",
                "label": "IEEE Sites",
                "desc": "Explore IEEE's main platforms"
            },
            {
                "id": "membership",
                "icon": "fa-user-plus",
                "label": "Membership",
                "desc": "Who can join and benefits"
            }
        ],
        "ieeeDetails": {
            "about": {
                "title": "What is IEEE?",
                "cardType": "about",
                "tagline": "Advancing Technology for Humanity",
                "description": "IEEE (Institute of Electrical and Electronics Engineers) is the world's largest professional organization for engineers and technologists. Founded in 1963, IEEE brings together over 500,000 members in 190+ countries to drive innovation, set standards, and promote excellence across electrical, electronics, communication, and computing fields. IEEE empowers professionals through conferences, publications, education, and networking.",
                "image": "/img/ieee/ieee_about.webp",
                "facts": [
                    {
                        "icon": "fa-globe",
                        "text": "Active in 190+ countries"
                    },
                    {
                        "icon": "fa-user-plus",
                        "text": "500,000+ members worldwide"
                    },
                    {
                        "icon": "fa-book",
                        "text": "Publishes over 200 journals and magazines"
                    },
                    {
                        "icon": "fa-calendar-alt",
                        "text": "Organizes 300+ conferences yearly"
                    },
                    {
                        "icon": "fa-cogs",
                        "text": "Leader in international technology standards"
                    }
                ],
                "highlights": [
                    {
                        "icon": "fa-bolt",
                        "heading": "Innovation",
                        "text": "IEEE fuels creativity and progress by developing breakthrough technologies and supporting research."
                    },
                    {
                        "icon": "fa-users",
                        "heading": "Community",
                        "text": "An open, global network for engineers, scientists, educators, and students to collaborate."
                    },
                    {
                        "icon": "fa-shield-alt",
                        "heading": "Standards",
                        "text": "IEEE creates standards for Wi-Fi, Ethernet, and hundreds of modern technologies."
                    }
                ],
                "website": "https://www.ieee.org/about-ieee"
            },
            "numbers": {
                "title": "Key Numbers",
                "description": "",
                "points": [
                    {
                        "icon": "fa-user-plus",
                        "text": "500,000+ members"
                    },
                    {
                        "icon": "fa-globe",
                        "text": "190+ countries"
                    },
                    {
                        "icon": "fa-book",
                        "text": "200+ Journals"
                    },
                    {
                        "icon": "fa-calendar-alt",
                        "text": "300+ conferences/year"
                    }
                ]
            },
            "history": {
                "title": "IEEE: A Legacy of Innovation",
                "cardType": "history",
                "headline": "Global Impact Rooted in Over a Century of Progress",
                "description": "Founded from the merger of two pioneering societies, IEEE’s heritage spans the birth of electricity to the era of global connectivity. IEEE has shaped standards, nurtured engineers, and enabled technological leaps that changed the world.",
                "timeline": [
                    {
                        "year": "1884",
                        "event": "AIEE Founded",
                        "icon": "fa-bolt",
                        "desc": "The American Institute of Electrical Engineers (AIEE) is formed in New York City, marking the organization of electrical pioneers like Thomas Edison and Alexander Graham Bell."
                    },
                    {
                        "year": "1912",
                        "event": "IRE Established",
                        "icon": "fa-signal",
                        "desc": "The Institute of Radio Engineers (IRE) emerges as the world’s first professional radio society, reflecting the explosion of wireless innovation."
                    },
                    {
                        "year": "1963",
                        "event": "Birth of IEEE",
                        "icon": "fa-atom",
                        "desc": "AIEE and IRE merge to create IEEE—the Institute of Electrical and Electronics Engineers—uniting the world’s electrical and electronics experts."
                    },
                    {
                        "year": "1984",
                        "event": "Centennial & Globalization",
                        "icon": "fa-globe",
                        "desc": "IEEE marks 100 years since AIEE’s founding. IEEE boasts 250,000 members with a rapidly growing international presence."
                    },
                    {
                        "year": "Today",
                        "event": "World Leader in Standards",
                        "icon": "fa-award",
                        "desc": "With over 500,000 members in more than 190 countries, IEEE drives innovation, sets influential technology standards, and powers diverse fields from the Internet to renewable energy."
                    }
                ],
                "website": "https://www.ieee.org/about/ieee-history"
            },
            "ieeesites": {
                "title": "Main IEEE Websites",
                "cardType": "sites",
                "sites": [
                    {
                        "id": "xplore",
                        "name": "IEEE Xplore",
                        "desc": "IEEE Xplore is the official digital library of IEEE, providing full-text searchable access to nearly 4 million documents, including technical papers, journals, conference proceedings, and industry standards. Its powerful search tools and daily content updates make it the go-to resource for scientific discovery in engineering, technology, and computer science.",
                        "importance": "A must-have for engineers, students, and researchers to track global innovations, gather trusted research, and fuel technology breakthroughs anytime.",
                        "link": "https://ieeexplore.ieee.org/Xplore/home.jsp",
                        "img": "/img/ieee/xplore_logo.webp"
                    },
                    {
                        "id": "standards",
                        "name": "IEEE Standards",
                        "desc": "IEEE Standards is the hub for international consensus-driven guidelines that shape the modern technological world. With over 1,300 active standards, IEEE sets the global rules for industries from telecommunications and networking to energy and healthcare, ensuring devices and systems work together safely and efficiently.",
                        "importance": "Empowers innovation by providing essential protocols for communication, electrical safety, efficiency, and interoperability—making global tech seamless and secure.",
                        "link": "https://standards.ieee.org/",
                        "img": "/img/ieee/standards_logo.png"
                    },
                    {
                        "id": "spectrum",
                        "name": "IEEE Spectrum",
                        "desc": "IEEE Spectrum is the flagship award-winning magazine and news site of IEEE, delivering in-depth analysis, news, podcasts, and features about the latest trends, advancements, and impacts in engineering and applied sciences. It keeps over 400,000 IEEE members and millions of tech enthusiasts informed about what matters most in the industry.",
                        "importance": "Your essential source for staying updated on emerging technologies, real-world engineering innovations, and visionary breakthroughs shaping tomorrow’s world.",
                        "link": "https://spectrum.ieee.org/",
                        "img": "/img/ieee/spectrum_logo.webp"
                    }
                ]
            },
            "membership": {
                "title": "IEEE Membership",
                "cardType": "membership",
                "description": "Become part of a global network of over 500,000 technology professionals. IEEE membership offers unparalleled opportunities for learning, innovation, networking, and professional growth. Whether you’re a student, young professional, or experienced engineer, IEEE provides the resources and connections to advance your career.",
                "benefits": [
                    "Access to the world’s largest library of technical literature and latest research.",
                    "Discounts on conferences, workshops, certification programs, and industry events.",
                    "Opportunities for travel grants, scholarships, and awards.",
                    "Eligibility to join and participate in IEEE societies, chapters, and local groups.",
                    "Professional mentoring, career development, and networking with leading experts.",
                    "Stay updated with IEEE Spectrum magazine, industry news, and exclusive newsletters.",
                    "Boost your CV and profile credibility with global recognition.",
                    "Special offers for students, including unique projects, competitions and financial support."
                ],
                "joinLink": "https://www.ieee.org/membership/join#chapter=id-7311-Students-"
            }
        }
    }
}